---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamOrientation
source: html/6494681b-d512-f9ab-0f14-c19216c6b028.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamOrientation Property

"Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamOrientation { get; }
```